src/Enums/уатГруппыГСМ/уатГруппыГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппыГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>ПрисадкиИТехническиеЖидкости</name>
  </enumValues>
  <enumValues>
    <name>Талон</name>
  </enumValues>
  <enumValues>
    <name>Топливо</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМасло</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатГруппыГСМ/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.Топливо);
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.Талон);
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости);
		
КонецПроцедуры

#КонецОбласти
